IdeaRS.OpenModel.Material.MatReinforcementEc2
Material reinforcement Ec2
This sample shows how to create reinforcement material.
//Creating the model
OpenModel openModel = new OpenModel();
//Reinforcement material
MatReinforcementEc2 matR = new MatReinforcementEc2();
matR.Name = "Reinf";
matR.UnitMass = 7850.0;
matR.E = 200e9;
matR.Poisson = 0.2;
matR.G = 83.333e9;
matR.SpecificHeat = 0.6;
matR.ThermalExpansion = 0.00001;
matR.ThermalConductivity = 45;
matR.BarSurface = ReinfBarSurface.Ribbed;
matR.Fyk = 387e6;
matR.CoeffFtkByFyk = 1.05;
matR.Epsuk = 0.025;
matR.Class = ReinfClass.A;
matR.Type = ReinfType.Bars;
matR.Fabrication = ReinfFabrication.HotRolled;
matR.DiagramType = ReinfDiagramType.BilinerWithAnInclinedTopBranch;
//Setting thermal characteristcs of material (in this case by the code)
matR.StateOfThermalConductivity = ThermalConductivityState.Code;
matR.StateOfThermalExpansion = ThermalExpansionState.Code;
matR.StateOfThermalSpecificHeat = ThermalSpecificHeatState.Code;
matR.StateOfThermalStressStrain = ThermalStressStrainState.Code;
openModel.AddObject(matR);

IdeaRS.OpenModel.Material.MatReinforcementEc2.Fyk
Characteristic yield strength of reinforcement - fyk

IdeaRS.OpenModel.Material.MatReinforcementEc2.CoeffFtkByFyk
Coefficient  ftk/fyk - k

IdeaRS.OpenModel.Material.MatReinforcementEc2.Epsuk
Characteristic strain of reinforcement at maximum load - εuk

IdeaRS.OpenModel.Material.MatReinforcementEc2.Ftk
Characteristic tensile strength of reinforcement - ftk

IdeaRS.OpenModel.Material.MatReinforcementEc2.Class
Class of reinforcement

IdeaRS.OpenModel.Material.MatReinforcementEc2.Type
Type of reinforcement

IdeaRS.OpenModel.Material.MatReinforcementEc2.Fabrication
Fabrication of reinforcement

IdeaRS.OpenModel.Material.MatReinforcementEc2.DiagramType
Type of material diagram

IdeaRS.OpenModel.Material.MatReinforcementEc2.UserDiagram
Stress-strain diagram defined by user